Revit 2027 API
RevisionNumberingSequence.NumberType Property
 Indicates the revision number type of the revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevisionNumberType NumberType { get; }
Public ReadOnly Property NumberType As RevisionNumberType
	Get
public:
property RevisionNumberType NumberType {
	RevisionNumberType get ();
}
member NumberType : RevisionNumberType with get
Property Value
RevisionNumberType
Exceptions
Exception | Condition
InvalidOperationException |  This RevisionNumberingSequence doesn't own a valid revision settings for number type.
Remarks
 This property can be used to figure out if a revision numbering sequence is numeric or alphanumeric. The returned RevisionNumberType is either RevisionNumberType::Numeric or RevisionNumberType::Alphanumeric.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace